'''
Вывести таблицу умножения на экран.
'''

for i in range(2,10):
    print('Таблица умножения для', i)
    for ii in range(2, 10):
        print(i, '*', ii, '=', i * ii)

