"""
Задача №3
Программа должна переводить число, введенное с клавиатуры в метрах, в километры.
"""

meters = float(input('Введите значение в метрах: '))
converted_km = meters / 1000

print('Результат конвертации значения: ',converted_km,' км')